{
    "layout": {
        "description": "Contratame para crear tu aplicación web. Desarrollador Web e Ingeniero de Sistemas. Especializado en crear aplicaciones únicas.",
        "title": "Portafolio de Fidel García - Desarrollador y Programador Web"
    },
    "header": {
        "openMenu": "Abrir menú",
        "home": "Inicio",
        "about": "Sobre mi",
        "experience": "Experiencia",
        "skills": "Habilidades",
        "projects": "Proyectos",
        "contact": "Contacto"
    },
    "footer": {
        "rights": "Todos los derechos reservados",
        "signature": "EFGT",
        "facebookProfile": "Perfil de Facebook",
        "githubProfile": "Perfil de GitHub",
        "linkedinProfile": "Perfil de LinkedIn"
    },
    "about": {
        "title": "Sobre mi",
        "description": "Mi nombre es Edwin Fidel García Távara. Comencé mi carrera en la programación con un proyecto de inventario. Actualmente trabajo enfocado en el backend.\nAlgunos de mis logros incluyen colaborar en un proyecto para una empresa en España, y crear un sistema de gestión de cultivos para una empresa en mi país.\nMi objetivo es mejorar como desarrollador para convertirme en un Arquitecto de Software."
    },
    "banner": {
        "title": "Edwin Fidel García Távara",
        "subtitle": "{{years}} años de experiencia. Desarrollador Web enfocado en el backend de Piura, Perú",
        "projects": "Proyectos",
        "linkedin": "LinkedIn"
    },
    "experience": {
        "title": "Experiencia",
        "first": {
            "title": "Software Developer Full Stack",
            "jobName": "Proyecto Especial Chira Piura",
            "date": "Enero 2021 – Enero 2023",
            "descriptionOne": "Diseñé un sistema de inventario con arquitectura limpia y desarrollo orientado a pruebas (TDD) usando Laravel y Spring Boot.",
            "descriptionTwo": "Implementé autenticación y autorización seguras con OAuth2, cumpliendo estándares de desarrollo seguro.",
            "descriptionThree": "Colaboré en la migración de sistemas monolíticos hacia microservicios, mejorando la mantenibilidad del código."
        },
        "second": {
            "title": "Software Developer Full Stack",
            "jobName": "Ecosac",
            "date": "Agosto 2023 – Abril 2024",
            "descriptionOne": "Desarrollé sistemas web para gestión agrícola y administrativa con Laravel, Vue.js, MySQL y MSSQL.",
            "descriptionTwo": "Integré Spring Boot con SAP (Service Layer, DiApi) mediante APIs RESTful para procesos logísticos.",
            "descriptionThree": "Implementé caché con Redis, mejorando el rendimiento de planificaciones críticas en más de un 40%."
        },
        "third": {
            "title": "Software Developer Full Stack",
            "jobName": "YarosLab",
            "date": "Julio 2024 – Noviembre 2024",
            "descriptionOne": "Desarrollé un proyecto turístico full stack con Laravel, Inertia.js y Vue.js, logrando +5000 visitas mensuales.",
            "descriptionTwo": "Diseñé microservicios con Spring Boot y Kafka para procesamiento de eventos del sector turístico.",
            "descriptionThree": "Optimicé el rendimiento y aseguré la calidad del código con SonarLint/SonarQube y pipelines CI/CD."
        },
        "fourth": {
            "title": "Software Developer Full Stack",
            "jobName": "Universidad Nacional de Frontera",
            "date": "Diciembre 2024 – Marzo 2025",
            "descriptionOne": "Desarrollé microservicios con Spring Boot y Java 8/11/17 aplicando DDD y arquitectura hexagonal.",
            "descriptionTwo": "Integré sistemas académicos y financieros con PostgreSQL y MSSQL, reduciendo tiempos de respuesta a <200ms.",
            "descriptionThree": "Refactoricé sistemas .NET 6 bajo Clean Architecture, reduciendo un 60% los tiempos de inactividad."
        },
        "fifth": {
            "title": "Software Backend Developer",
            "jobName": "Invian International",
            "date": "Abril 2025 – Julio 2025",
            "descriptionOne": "Desarrollé y mantuve microservicios backend con Laravel y PostgreSQL, empleando estructuras modulares basadas en paquetes y repositorios independientes.",
            "descriptionTwo": "Implementé consultas SQL optimizadas y control de versiones con Git Flow, asegurando la estabilidad del entorno mediante Docker y despliegues multiambiente.",
            "descriptionThree": "Colaboré en la integración de servicios en Java con Spring Boot, Gradle y WebFlux, fortaleciendo la interoperabilidad y el rendimiento del ecosistema backend."
        },
        "sixth":{
            "title": "Software Engineer II",
            "jobName": "Encora (Cliente Scotiabank)",
            "date": "Agosto 2025 - Actualidad",
            "descriptionOne": "Desarrollo de microservicios financieros con Spring Boot y WebFlux, aplicando patrones de resiliencia.",
            "descriptionTwo": "Implementación de CI/CD con GitHub Actions y monitoreo con SonarQube y Prometheus.",
            "descriptionThree": "Participación en revisiones de código y auditorías de seguridad bajo estándares de banca digital."
        }
    },
    "skills": {
        "title": "Habilidades",
        "frontend": "Frontend",
        "backend": "Backend",
        "others": "Otros"
    },
    "contact": {
        "title": "Contacto",
        "description": "¿Tienes un proyecto en mente? ¡Hablemos y hagámoslo realidad juntos!",
        "form": {
            "email": "Tu correo",
            "emailPlaceholder": "tu_correo@ejemplo.com",
            "subject": "Asunto",
            "subjectPlaceholder": "¿Sobre qué quieres hablar?",
            "message": "Tu mensaje",
            "messagePlaceholder": "Cuéntame más sobre tu proyecto",
            "send": "Enviar",
            "sending": "Enviando...",
            "successMessage": "¡Mensaje enviado exitosamente! Me pondré en contacto contigo pronto.",
            "errorMessage": "Hubo un problema al enviar el mensaje. Por favor, intenta nuevamente."
        }
    },
    "projects": {
        "title": "Proyectos",
        "description": "Estos son algunos de los proyectos en los que he trabajado.",
        "view": "Ver proyecto"
    },
    "notFound": {
        "title": "404",
        "subtitle": "Página no encontrada",
        "description": "Lo sentimos, no podemos encontrar esa página. Encontrarás mucho para explorar en la página de inicio.",
        "home": "Volver a la página de inicio"
    }
}
